<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.Spotify</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_ARCH</key>
		<string></string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string></string>
		<key>NAME</key>
		<string>Spotify</string>
		<key>SUPPORTED_ARCH</key>
		<string>x86_64</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>test</string>
			</array>
			<key>description</key>
			<string>Spotify is a music streaming service offering unlimited streaming of selected music from a range of major and independent record labels.</string>
			<key>category</key>
			<string>Entertainment</string>
			<key>display_name</key>
			<string>Spotify</string>
			<key>developer</key>
			<string>Spotify</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
				# Add directory traversal for the entire application and ensure
				# all executables are executable by group and other
				/bin/chmod -R go+rX /Applications/Spotify.app
			</string>
			<key>supported_architectures</key>
			<array>
				<string>%SUPPORTED_ARCH%</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.Spotify</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.Spotify</key>
			<dict>
				<key>git_hash</key>
				<string>fe47666ce03dbc8ad564525f27ce615e4280fd7b</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Spotify/Spotify.download.recipe</string>
				<key>sha256_hash</key>
				<string>260a000965a5aa0768ab06f142cea894eedf74e1da82c72f66e9891fd474429b</string>
			</dict>
			<key>com.github.autopkg.munki.Spotify</key>
			<dict>
				<key>git_hash</key>
				<string>fe47666ce03dbc8ad564525f27ce615e4280fd7b</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Spotify/Spotify.munki.recipe</string>
				<key>sha256_hash</key>
				<string>c303e339f8359d39d14c2276847a222eb9b1ca3e148a0a62d60a729be928b32d</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
